---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipePressureDropServer.Calculate(Autodesk.Revit.DB.Plumbing.PipePressureDropData)
source: html/8af1cf1a-1cc0-8fcd-7845-f7ac2a653425.htm
---
# Autodesk.Revit.DB.Plumbing.IPipePressureDropServer.Calculate Method

Calculate the pipe pressure drop.

## Syntax (C#)
```csharp
void Calculate(
	PipePressureDropData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Plumbing.PipePressureDropData`) - The input and output data of the calculation.